Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: When an option has a value that is a list of flags or items, consider using "+=" and "-=" to keep the existing value. Be aware that the user may have changed an option value already. First resetting to the default value and then changing it often a good idea. Example: >
es_es: Cuando una opción tiene un valor que es una lista de opciones o elementos, considere usar «+=» y «-=» para conservar el valor existente. Sea consciente de que puede que el usuario ya haya cambiado el valor de una opción. Es una buena idea restablecer el valor original y después cambiarlo. Ejemplo: >

source: |hasmapto()| is used to check if the user has already defined a map to <Plug>JavaImport. If not, then the filetype plugin defines the default mapping. This starts with |<LocalLeader>|, which allows the user to select the key(s) he wants filetype plugin mappings to start with. The default is a backslash. "<unique>" is used to give an error message if the mapping already exists or overlaps with an existing mapping. |:noremap| is used to avoid that any other mappings that the user has defined interferes. You might want to use ":noremap <script>" to allow remapping mappings defined in this script that start with <SID>.
es_es: |hasmapto()| sirve para comprobar si el usuario ya ha definido una macro para «<Plug>JavaImport». Si no ha sido definida, la extensión de tipo de archivo define la macro actual. Esta empieza con |<LocalLeader>|, que permite al usuario seleccionar una o mas teclas con las que iniciar las macros de la extensión de tipo de archivo. El valor predeterminado es una barra inversa, «\». «<unique>» sirve para emitir un mensaje de error si la macro ya existe o entra en conflicto con otra. |:noremap| sirve para evitar que las macros definidas por el usuario interfieran. Puede que desee usar «:noremap <script>» para permitir redefinir macros en el script que comienza con <SID>.

source: The user must have a chance to disable the mappings in a filetype plugin, without disabling everything. Here is an example of how this is done for a plugin for the mail filetype: >
es_es: Tiene que ofrecer al usuario la opción de desactivar macros en una extensión de tipo de archivo, sin desactivar el resto. Aquí tiene un ejemplo de como hacerlo con una extensión para el tipo de archivo mail: >

source: " Add mappings, unless the user didn't want this. if !exists("no_plugin_maps") && !exists("no_mail_maps") " Quote text by inserting "> " if !hasmapto('<Plug>MailQuote') vmap <buffer> <LocalLeader>q <Plug>MailQuote nmap <buffer> <LocalLeader>q <Plug>MailQuote endif vnoremap <buffer> <Plug>MailQuote :s/^/> /<CR> nnoremap <buffer> <Plug>MailQuote :.,$s/^/> /<CR> endif
es_es: " Añade macros, a menos que el usuario defina lo contrario. if !exists("no_plugin_maps") && !exists("no_mail_maps") " Cita el texto insertando «> » if !hasmapto('<Plug>MailQuote') vmap <buffer> <LocalLeader>q <Plug>MailQuote nmap <buffer> <LocalLeader>q <Plug>MailQuote endif vnoremap <buffer> <Plug>MailQuote :s/^/> /<CR> nnoremap <buffer> <Plug>MailQuote :.,$s/^/> /<CR> endif

source: Two global variables are used: no_plugin_maps disables mappings for all filetype plugins no_mail_maps disables mappings for a specific filetype
es_es: Se utilizan dos variables globales: no_plugin_maps desactiva las macros de todas las extensiones de tipo de archivo no_mail_maps desactiva las macros para un tipo de archivo particular

source: To add a user command for a specific file type, so that it can only be used in one buffer, use the "-buffer" argument to |:command|. Example: >
es_es: El argumento «-buffer» de |:command| permite añadir una orden de usuario para un tipo de archivo específico y que solo afecta al búfer local. Ejemplo: >

source: When defining a function, this only needs to be done once. But the filetype plugin will be sourced every time a file with this filetype will be opened. This construct makes sure the function is only defined once: >
es_es: Cada función necesita ser definida una sola vez. Pero la extensión de tipo de archivo se cargará cada vez que se abra un archivo del tipo correspondiente. Esta estructura asegura que la función se defina una sola vez: >

source: UNDO *undo_ftplugin*
es_es: DESHACER *undo_ftplugin*

source: When the user does ":setfiletype xyz" the effect of the previous filetype should be undone. Set the b:undo_ftplugin variable to the commands that will undo the settings in your filetype plugin. Example: >
es_es: Cuando el usuario hace «:setfiletype xyz», el efecto del tipo de archivo anterior debería desaparecer. Defina la variable «b:undo_ftplugin» con las órdenes que deshacen los cambios de configuración de su extensión de tipo de archivo. Ejemplo: >

source: Using ":setlocal" with "<" after the option name resets the option to its global value. That is mostly the best way to reset the option value.
es_es: Usar «:setlocal» con «<» después del nombre de la opción restablece la opción a su valor global. Habitualmente, es la mejor forma de restablecer el valor de una opción.

source: The filetype must be included in the file name |ftplugin-name|. Use one of these three forms:
es_es: El nombre del archivo debe incluir el tipo de archivo |ftplugin-name|. Puede usar una de las tres formas a continuación:

source: .../ftplugin/stuff.vim .../ftplugin/stuff_foo.vim .../ftplugin/stuff/bar.vim
es_es: .../ftplugin/algo.vim .../ftplugin/algo_foo.vim .../ftplugin/algo/bar.vim

source: SUMMARY *ftplugin-special*
es_es: RESUMEN *ftplugin-special*

source: <LocalLeader> Value of "maplocalleader", which the user defines as the keys that filetype plugin mappings start with.
es_es: <LocalLeader> El valor de «maplocalleader», que el usuario define como la tecla que inicia las macros de extensión de tipo de archivo.

source: :map <buffer> Define a mapping local to the buffer.
es_es: :map <buffer> Define una macro local al búfer.

source: :noremap <script> Only remap mappings defined in this script that start with <SID>.
es_es: :noremap <script> Sólo modifica macros definidas en el script que comienzan con <SID>.

source: :setlocal Set an option for the current buffer only.
es_es: :setlocal Define una opción para el búfer actual.

source: :command -buffer Define a user command local to the buffer.
es_es: :command -buffer Define una orden de usuario local al búfer.

source: exists("*s:Func") Check if a function was already defined.
es_es: exists("*s:Funcion") Comprueba si una función ya se ha definido anteriormente.

source: *41.13* Writing a compiler plugin *write-compiler-plugin*
es_es: *41.13* Escribir extensiones para compiladores *write-compiler-plugin*

source: A compiler plugin sets options for use with a specific compiler. The user can load it with the |:compiler| command. The main use is to set the 'errorformat' and 'makeprg' options.
es_es: Una extensión de compilador define opciones a usar con un compilador específico. El usuario puede cargarlo con la orden |:compiler|. El uso principal es definir las opciones 'errorformat' y 'makeprg'.

source: Easiest is to have a look at examples. This command will edit all the default compiler plugins: >
es_es: Lo más sencillo es ver unos ejemplos. Esta orden editará todas las extensiones de compilador predeterminadas: >

source: There are two special items about these files. First is a mechanism to allow a user to overrule or add to the default file. The default files start with: >
es_es: Hay dos aspectos a tener en cuenta con estas extensiones. En primer lugar, deben contar con un mecanismo que permita al usuario anular o añadir cambios a la extensión. Las extensiones predeterminadas comienzan con: >

source: When you write a compiler file and put it in your personal runtime directory (e.g., ~/.vim/compiler for Unix), you set the "current_compiler" variable to make the default file skip the settings. *:CompilerSet* The second mechanism is to use ":set" for ":compiler!" and ":setlocal" for ":compiler". Vim defines the ":CompilerSet" user command for this. However, older Vim versions don't, thus your plugin should define it then. This is an example: >
es_es: Cuando escribe un archivo de compilador, y lo ubica en su directorio de ejecución personal (esto es, «~/.vim/compiler» en sistemas Unix), debe definir la variable «current_compiler» para que la extensión de compilador predeterminada evite hacer cambios en la configuración. *:CompilerSet* El segundo mecanismo es usar «:set» con «:compiler!», y «:setlocal» con «:compiler». Para ello, Vim define la orden de usuario «:CompilerSet». Por otra parte, las versiones anteriores de Vim no cuentan de ella, y por ello su extensión debe definirlo. Aquí tiene un ejemplo: >

source: if exists(":CompilerSet") != 2 command -nargs=* CompilerSet setlocal <args> endif CompilerSet errorformat& " use the default 'errorformat' CompilerSet makeprg=nmake
es_es: if exists(":CompilerSet") != 2 command -nargs=* CompilerSet setlocal <args> endif CompilerSet errorformat& " usa 'errorformat' predeterminado CompilerSet makeprg=nmake

source: When you write a compiler plugin for the Vim distribution or for a system-wide runtime directory, use the mechanism mentioned above. When "current_compiler" was already set by a user plugin nothing will be done.
es_es: Use el mecanismo mostrado aquí cuando escriba una extensión de compilador para la distribución Vim o para un directorio de tiempo de ejecución del sistema. No se hará nada si «current_compiler» ya está definido por una extensión de usuario.

source: When you write a compiler plugin to overrule settings from a default plugin, don't check "current_compiler". This plugin is supposed to be loaded last, thus it should be in a directory at the end of 'runtimepath'. For Unix that could be ~/.vim/after/compiler.
es_es: Cuando escribe una extensión de compilador para cambiar las opciones definidas por una extensión predeterminada, evite comprobar «current_compiler». Esta extensión se debería cargar al final, y por ello debería estar en un directorio al final de 'runtimepath'. En sistemas Unix, podría ser «~/.vim/after/compiler».

source: *41.14* Writing a plugin that loads quickly *write-plugin-quickload*
es_es: *41.14* Escribir extensiones que carguen rápidamente *write-plugin-quickload*

source: A plugin may grow and become quite long. The startup delay may become noticeable, while you hardly ever use the plugin. Then it's time for a quickload plugin.
es_es: Puede que una extensión crezca, y que sea demasiado larga. Puede que el tiempo de carga empiece a hacerse notorio, y además, que usted apenas use la extensión. En este caso, hay que usar una extensión de carga rápida («quickload»).

source: The basic idea is that the plugin is loaded twice. The first time user commands and mappings are defined that offer the functionality. The second time the functions that implement the functionality are defined.
es_es: La idea principal es que la extensión se carga dos veces. La primera vez, se definen las órdenes de usuario y macros que ofrecen la funcionalidad de la extensión. La segunda vez, se definen las funciones que implementan tales funcionalidades.

source: It may sound surprising that quickload means loading a script twice. What we mean is that it loads quickly the first time, postponing the bulk of the script to the second time, which only happens when you actually use it. When you always use the functionality it actually gets slower!
es_es: Puede que sorprenda que «carga rápida» signifique cargar una extensión dos veces. Lo que queremos decir es que se carga rápidamente la primera, demorando la carga de la mayoría de la extensión a la segunda vez, lo que sólo ocurre cuando realmente la usa. ¡Si usa siempre la funcionalidad que provee la extensión, no obtendrá ninguna ventaja!

source: " Vim global plugin for demonstrating quick loading " Last Change: 2005 Feb 25 " Maintainer: Bram Moolenaar <Bram@vim.org> " License: This file is placed in the public domain.
es_es: " Extensión global de Vim para mostrar la carga rápida " Último cambio: 2005 Feb 25 " Desarrollador: Bram Moolenaar <Bram@vim.org> " Licencia: Este archivo se encuentra en el dominio público

source: if !exists("s:did_load") command -nargs=* BNRead call BufNetRead(<f-args>) map <F19> :call BufNetWrite('something')<CR>
es_es: if !exists("s:did_load") command -nargs=* BNRead call BufNetRead(<f-args>) map <F19> :call BufNetWrite('algo')<CR>

source: function BufNetRead(...) echo 'BufNetRead(' . string(a:000) . ')' " read functionality here endfunction
es_es: function BufNetRead(...) echo 'BufNetRead(' . string(a:000) . ')' " Funcionalidad de lectura aquí endfunction

source: function BufNetWrite(...) echo 'BufNetWrite(' . string(a:000) . ')' " write functionality here endfunction
es_es: function BufNetWrite(...) echo 'BufNetWrite(' . string(a:000) . ')' " Funcionalidad de escritura aquí endfunction

source: The second time the script is loaded "s:did_load" exists and the commands after the "endif" are executed. This defines the (possible long) BufNetRead() and BufNetWrite() functions.
es_es: La segunda vez que se carga, «s:did_load» existe y se ejecutan las órdenes después de «endif». Esto define las (posiblemente largas) funciones BufNetRead() y BufNetWrite().

source: If you drop this script in your plugin directory Vim will execute it on startup. This is the sequence of events that happens:
es_es: Si ubica este script en su directorio «plugin», Vim lo ejecutará al inicio. A continuación la secuencia de los eventos:

source: 1. The "BNRead" command is defined and the <F19> key is mapped when the script is sourced at startup. A |FuncUndefined| autocommand is defined. The ":finish" command causes the script to terminate early.
es_es: 1. Se define la orden «BNRead» y la tecla <F19> se asigna a una macro al cargar el script al inicio. Se define una orden automática |FuncUndefined|. La orden «:finish» hace que el script finalice antes.

source: 2. The user types the BNRead command or presses the <F19> key. The BufNetRead() or BufNetWrite() function will be called.
es_es: 2. El usuario introduce la orden «BNRead» o pulsa la tecla <F19>. Se invoca la función «BufNetRead()» o «BufNetWrite()».

source: 3. Vim can't find the function and triggers the |FuncUndefined| autocommand event. Since the pattern "BufNet*" matches the invoked function, the command "source fname" will be executed. "fname" will be equal to the name of the script, no matter where it is located, because it comes from expanding "<sfile>" (see |expand()|).
es_es: 3. Vim no puede encontrar la función y ejecuta la orden automática |FuncUndefined|. Ya que el patrón «BufNet*» coincide con la función invocada, se ejecutará la orden «source nombre-archivo». «nombre-archivo» debe ser igual al nombre del script, sin importar su ubicación, ya que procede de expandir «<sfile>» (consulte |expand()|).

source: 4. The script is sourced again, the "s:did_load" variable exists and the functions are defined.
es_es: 4. El script se carga otra vez, la variable «s:did_load» existe, y se definen las funciones.

source: Notice that the functions that are loaded afterwards match the pattern in the |FuncUndefined| autocommand. You must make sure that no other plugin defines functions that match this pattern.
es_es: Tenga en cuenta que las funciones se cargan después de comparar el patrón en la orden automática |FuncUndefined|. Debe comprobar que ninguna otra extensión define funciones que coincidan con este patrón.

source: *41.15* Writing library scripts *write-library-script*
es_es: *41.15* Crear bibliotecas *write-library-script*

source: Some functionality will be required in several places. When this becomes more than a few lines you will want to put it in one script and use it from many scripts. We will call that one script a library script.
es_es: Algunas funcionalidades son necesarias en varios lugares. Cuando se trata de algo más que unos pocas líneas, querrá ubicarlo en un script, y usarlo desde varios otros. Vamos a denominar ese script como biblioteca.

source: Manually loading a library script is possible, so long as you avoid loading it when it's already done. You can do this with the |exists()| function. Example: >
es_es: Cargar una biblioteca manualmente es posible, siempre que evite cargarla cuando ya lo está. Puede evitarlo con la función |exists()|. Ejemplo: >

source: if !exists('*MyLibFunction') runtime library/mylibscript.vim endif call MyLibFunction(arg)
es_es: if !exists('*MiFuncionBiblioteca') runtime library/biblioteca.vim endif call MiFuncionBiblioteca(arg)

source: To make this a bit simpler Vim offers the autoload mechanism. Then the example looks like this: >
es_es: Para hacer esto más sencillo, Vim ofrece el mecanismo «autoload» (carga automática). Así, el ejemplo tendría este aspecto: >

source: call mylib#myfunction(arg)
es_es: call mibiblioteca#mifuncion(arg)

source: That's a lot simpler, isn't it? Vim will recognize the function name and when it's not defined search for the script "autoload/mylib.vim" in 'runtimepath'. That script must define the "mylib#myfunction()" function.
es_es: Mucho más sencillo, ¿verdad? Vim reconoce el nombre de la función y, cuando no esté definida, la buscará el script «autoload/mibiblioteca.vim» en 'runtimepath'. El script debe definir la función «mibiblioteca#mifuncion()».

source: You can put many other functions in the mylib.vim script, you are free to organize your functions in library scripts. But you must use function names where the part before the '#' matches the script name. Otherwise Vim would not know what script to load.
es_es: Puede almacenar varias funciones en el script mibiblioteca.vim, y puede organizar como desee las funciones en sus bibliotecas. Pero debe usar nombres de funciones en las que la parte que precede a «#» coincide con el nombre del script. En caso contrario, Vim no sabrá qué script cargar.

source: If you get really enthusiastic and write lots of library scripts, you may want to use subdirectories. Example: >
es_es: Si esto le entusiasma, y escribe muchas bibliotecas, puede que quiera usar subdirectorios. Ejemplo: >

source: function netlib#ftp#read(fname) " Read the file fname through ftp endfunction
es_es: function netlib#ftp#read(nombre_archivo) " Lee al archivo mediante FTP endfunction

source: Notice that the name the function is defined with is exactly the same as the name used for calling the function. And the part before the last '#' exactly matches the subdirectory and script name.
es_es: Tenga en cuenta que el nombre con el que se define la función es idéntico al utilizado para invocar la función. Y la parte a continuación del último «#» coincide con el subdirectorio y el nombre del script.

source: let weekdays = dutch#weekdays
es_es: let dias_semana = colombia#dias_semana

source: let dutch#weekdays = ['zondag', 'maandag', 'dinsdag', 'woensdag', \ 'donderdag', 'vrijdag', 'zaterdag']
es_es: let colombia#dias_semana = ['lunes', 'martes', 'miércoles', 'jueves', \ 'viernes', 'sábado', 'domingo']

source: *41.16* Distributing Vim scripts *distribute-script*
es_es: *41.16* Distribuir scripts de Vim *distribute-script*

source: Vim users will look for scripts on the Vim website: http://www.vim.org. If you made something that is useful for others, share it!
es_es: Los usuarios de Vim buscarán scripts en el sitio web de Vim: http://www.vim.org. Si ha creado algo útil para otros, ¡compártalo!

source: Vim scripts can be used on any system. There might not be a tar or gzip command. If you want to pack files together and/or compress them the "zip" utility is recommended.
es_es: Los scripts de Vim se pueden usar en cualquier sistema. Las órdenes tar o gzip pueden no estar disponibles en dichos sistemas. Si desea empaquetar o comprimir los archivos, se recomienda usar la herramienta «zip».

source: For utmost portability use Vim itself to pack scripts together. This can be done with the Vimball utility. See |vimball|.
es_es: Para obtener la máxima portabilidad use Vim para empaquetar los scripts. Puede hacer esto con la herramienta Vimball. Consulte |vimball|.

source: It's good if you add a line to allow automatic updating. See |glvs-plugins|.
es_es: Es una buena idea añadir una línea para pemitir la actualización automática. Consulte |glvs-plugins|.

source: *usr_30.txt* For Vim version 7.3. Last change: 2007 Nov 10
es_es: *usr_30.esx* Para Vim versión 7.3. Último cambio: 10/11/2007

source: Editing programs
es_es: Edición de programas

source: |30.1| Compiling |30.2| Indenting C files |30.3| Automatic indenting |30.4| Other indenting |30.5| Tabs and spaces |30.6| Formatting comments
es_es: |30.1| Compilar |30.2| Sangrado en archivos C |30.3| Sangrado automático |30.4| Otros sangrados |30.5| Tabulados y espacios |30.6| Formatear comentarios

source: Next chapter: |usr_31.txt| Exploiting the GUI Previous chapter: |usr_29.txt| Moving through programs Table of contents: |usr_toc.txt|
es_es: Siguiente capítulo: |usr_31.esx| Sacar partido a la interfaz gráfica Capítulo anterior: |usr_29.esx| Moverse a través de programas Tabla de contenidos: |usr_toc.esx|

source: *30.1* Compiling
es_es: *30.1* Compilar

source: Vim has a set of so called "quickfix" commands. They enable you to compile a program from within Vim and then go through the errors generated and fix them (hopefully). You can then recompile and fix any new errors that are found until finally your program compiles without any error.
es_es: Vim tiene un conjunto de órdenes de arreglos rápidos («quickfix»). Permiten compilar un programa desde Vim y después navegar a través de los errores generados y (posiblemente) arreglarlos. Puede después recompilar y arreglar cualquier error nuevo detectado hasta que finalmente su programa se compile sin problemas.

source: If errors were generated, they are captured and the editor positions you where the first error occurred. Take a look at an example ":make" session. (Typical :make sessions generate far more errors and fewer stupid ones.) After typing ":make" the screen looks like this:
es_es: Si se genera algún error, se captura y el editor le posicionará sobre el primer error. Este es un ejemplo de una sesión típica de «:make». (Las sesiones típicas de «:make» generan muchos menos errores y menos errores estúpidos.) La pantalla presentará este aspecto después de teclear «:make»:

source: From this you can see that you have errors in the file "main.c". When you press <Enter>, Vim displays the file "main.c", with the cursor positioned on line 6, the first line with an error. You did not need to specify the file or the line number, Vim knew where to go by looking in the error messages.
es_es: Aquí puede ver que tiene errores en el archivo «main.c». Cuando pulse <Intro>, Vim mostrará el archivo «main.c», con el cursor posicionado en la línea 6, la primera con un error. No necesitó definir el archivo o el número de línea, ya que Vim sabe dónde ir analizando los mensajes de error.

source: Vim jumps to line 10, the last line in the file, where there is an extra '}'. When there is not enough room, Vim will shorten the error message. To see the whole message use: >
es_es: Vim salta a la línea 10, la última línea en el archivo, donde hay un «}» adicional. Cuando no hay suficiente espacio Vim acorta el mensaje de error. Para ver el mensaje completo, use lo siguiente: >

source: You can get an overview of all the error messages with the ":clist" command. The output looks like this: >
es_es: Puede obtener una visión general de todos los mensajes de error con la orden «:clist». La salida tiene el siguiente aspecto: >
